{
	// The URL of the Portal server on which a Script Portlet environment has been installed
	// and where content will be pushed.  The value's required format is "http://<host>:<port>"
	// or "https://<host>:<port>".  Required for the list and push commands.  If not provided,
	// then the tool will prompt for the value.
	//
	// "scriptPortletServer": "http://<host>:<port>",
	
	// Specifies whether to accept or reject self-signed certificates when using HTTPS to
	// communicate with the Portal server.  The default value of false rejects self-signed
	// certificates.
	//
	// "laxSSL": <true|false>,
	"laxSSL": true,

	// Specifies whether the Portal server requires authentication before executing a  command.
	// The default value of true causes the tool to require a user name and password to be
	// provided.  If the server does not require authentication, then the user name and password
	// are ignored if provided.
	//
	// "performAuth": <true|false>,
	"performAuth": true,


	// The name of the Portal user for authentication if the tool is challenged for credentials
	// while attempting to execute a command.  Required for all commands when -performAuth is
	// true.  If not provided, then the tool will prompt for the value.
	//
	// "portalUser": "<value>",
	"portalUser": "rfwal",

	// The password of the Portal user for authentication if the tool is challenged for credentials
	// while attempting to execute a command.  Required for all commands when -performAuth is true.
	// If not provided, then the tool will prompt for the value.  NOTE: As a security best practice
	// you should not store passwords in any configuration file.  Passwords should always be given
	// as a command line option or entered at the prompt.  The password property is presented here
	// only to provide brief documentation on its proper use
	//
	// "portalPassword": "<value>",

	// Specifies the maximum amount of time, in milliseconds, to wait for the tool to connect
	// to the Portal server.  The default value is 15000 (15 seconds).  An error will be
	// generated if Portal does not accept the connection within this time.
	//
	// "connectTimeout": <value>,

	// Specifies the maximum amount of time, in milliseconds, to wait for Portal to respond to
	// a command after a successful connection.  The default value is 15000 (15 seconds).  An
	// error will be generated if Portal does not respond to the command within this time.
	//
	// "socketTimeout": <value>,

	// Specifies the ID or context of the target virtual Portal to execute the action within.
	// Required when the content resides in a virtual Portal.  Optional if the content resides
	// in the root virtual Portal or if the Portal server named by the -scriptPortletServer option
	// contains only the root virtual Portal. This option has no default value.
	// "virtualPortalID": "<value>",
	"virtualPortalID": "teste",

	// Path to the main HTML file of the Script Portlet application.  The main HTML file is
	// the first file rendered by the portlet.  If -contentRoot is specified, then the HTML
	// file path must be relative to the value of -contentRoot.  When -prebuiltZIP is
	// specified the HTML file path must be relative to the top-level directory in the ZIP.
	// Required for the push command.  If not specified, then the tool attempts to locate a
	// file named either "index.html" or "index.htm" at the path specified by -contentRoot
	// or in the top-level directory of the ZIP.  If one of these files is found, then it
	// is used as the value of the main HTML file.  Otherwise the tool will prompt for the
	// value.
	//
	// "mainHtmlFile": "index.html",
	"mainHtmlFile": "index.html",

	// The WCM site area in which Script Portlet instances will be created.  Required by
	// the push command when -wcmContentID and -wcmContentPath are not given.  The default
	// value is "Script Portlet Library/Script Portlet Applications/" and corresponds to
	// the default site area created when the Script Portlet environment was installed
	// into Portal.
	//
	// "wcmSiteArea": "Script Portlet Library/Script Portlet Applications/",
	"wcmSiteArea": "Script Portlet Library/Script Portlet Applications/",
	// "wcmContentPath": "/Site do Portal / Conteúdo Raiz / ScriptPortlet / Untitled",
	"wcmContentTitle": "Teste de Script Portlet",
	"contentRoot": "./client"

	// Files that match the regular expressions below will be excluded from a content push
	// that is performed using content from a local folder.  These exclusions do not apply
	// to pre-built ZIP files.  Add and remove regular expressions to customize the set of
	// files excluded from your push requests.  The regular expressions must conform to the
	// rules defined in the JavaDoc for java.util.regex.Pattern.  This parameter cannot
	// be given as a command line option.
	//
	"excludes": [
		"^bin$",
		"^lib$",
		"^src$",
		"^\\.classpath$",
		"^\\.project$",
		"^sp-config.json$",
		"^sp-cmdln.log$",
		"^sp.bat$",
		"^sp.sh$",
	],
}
